spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
/**
 * @file smd_sat.cpp
 * @brief SMD satellite device driver — state machine, TX, credentials, DFU.
 */

#include <cstdint>
#include <cstring>
#include <cmath>

#include "bsp.hpp"
#include "error.hpp"
#include "debug.hpp"
#include "gpio.hpp"
#include "scheduler.hpp"
#include "timer.hpp"
#include "binascii.hpp"
#include "smd_sat.hpp"
#include "pmu.hpp"

#include "nrf_delay.h"
#include "nrf_gpio.h"

extern Scheduler *system_scheduler;
extern Timer *system_timer;

#include "config_store.hpp"
extern ConfigurationStore *configuration_store;

// ============================================================================
// Modulation conversion helpers (used by send() and switch_modulation())
// ============================================================================

static SmdArgosModulation kineis_to_smd_mod(KineisModulation mode) {
	switch (mode) {
		case KineisModulation::LDK:  return ARGOS_MOD_LDK;
		case KineisModulation::VLDA4: return ARGOS_MOD_VLDA4;
		case KineisModulation::LDA2:
		default:                      return ARGOS_MOD_LDA2;
	}
}

static KineisModulation smd_to_kineis_mod(SmdArgosModulation mode) {
	switch (mode) {
		case ARGOS_MOD_LDK:  return KineisModulation::LDK;
		case ARGOS_MOD_VLDA4: return KineisModulation::VLDA4;
		case ARGOS_MOD_LDA2:
		default:              return KineisModulation::LDA2;
	}
}

// ============================================================================
// Constructor / Destructor
// ============================================================================

SmdSat::SmdSat(SmdSatCmd& cmd, unsigned int idle_shutdown_ms)
	: m_cmd(cmd)
{
	DEBUG_TRACE("SmdSat::%s",__func__);
	set_idle_timeout(idle_shutdown_ms);
	m_packet_buffer.clear();
	m_modulation = ARGOS_MOD_LDA2;
	m_state = SmdSatState::stopped;
	m_stopping = false;
	m_state_counter = 0;
	m_next_delay = 0;
	m_tcxo_warmup_time = DEFAULT_TCXO_WARMUP_TIME_SECONDS;
	m_lpm_mode = 0x01;  // NONE by default
	m_tx_power = 0;
	m_tx_freq = 0.0;
	m_is_first_tx = true;
	this->shutdown();
	is_kmac_profil_loaded = false;
}

SmdSat::~SmdSat() {
	power_off_immediate();
}

// ============================================================================
// Power management
// ============================================================================

void SmdSat::shutdown(void) {
	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);  // Hold RESET LOW
	nrf_delay_ms(SMDSAT_DELAY_RST_MS);
	GPIOPins::clear(SAT_PWR_EN);  // Cut power
#ifdef SMD_VPA_PIN
	GPIOPins::drive_low(SMD_VPA_PIN);
#endif
	// Wait for VDD caps to discharge — ensures a true POR on next power_on.
	// Without this, the STM32WL stays alive on residual VDD (~10-50ms) and
	// resumes from its previous SPI sequence number, causing INVALID_CMD
	// when the nRF restarts with seq=0 after a soft reset.
	nrf_delay_ms(50);
}

void SmdSat::power_on_blocking() {
	DEBUG_INFO("SmdSat::%s: synchronous boot sequence", __func__);

	GPIOPins::acquire_sensors_pwr();

	// Hold RESET LOW during power ramp
	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);

#ifdef SAT_EXTWAKEUP
	GPIOPins::init_pin(SAT_EXTWAKEUP);
	GPIOPins::set(SAT_EXTWAKEUP);
#endif

	// Power ON — VPA stays LOW (driven by nRF) to prevent PA regulator spike
	GPIOPins::set(SAT_PWR_EN);
	PMU::kick_watchdog();
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);

	// Release RESET — STM32WL boots
	GPIOPins::release_to_highz(SAT_RESET);
	PMU::kick_watchdog();
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);

	// Init SPI AFTER boot (avoid MISO backfeed during power ramp)
	m_cmd.init();

	// Wait for STM32WL to respond
	bool ready = false;
	for (uint8_t attempt = 0; attempt < 10; attempt++) {
		PMU::kick_watchdog();
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS / 2);
		if (m_cmd.ping()) {
			ready = true;
			break;
		}
	}

	// VPA stays LOW until TX — released in state_transmit_pending, driven LOW again after TX
	if (!ready) {
		DEBUG_ERROR("SmdSat::%s: SMD did not respond after boot", __func__);
	}
}

void SmdSat::power_off() {
	DEBUG_TRACE("SmdSat::%s",__func__);
	if (!SMD_STATE_EQUAL(stopped)) {
		m_stopping = true;
	}
}

void SmdSat::power_on() {
	DEBUG_TRACE("SmdSat::%s",__func__);

	if (m_state != SmdSat::stopped) {
		m_stopping = false;
		DEBUG_TRACE("SmdSat::%s:: already running",__func__);
		return;
	}

	m_stopping = false;
	SMD_STATE_CHANGE(stopped, starting);
	DEBUG_TRACE("SmdSat::%s:: start state machine",__func__);
	state_machine();
}

void SmdSat::power_off_immediate()
{
	DEBUG_TRACE("SmdSat::%s",__func__);

	if (!SMD_STATE_EQUAL(stopped)) {
		system_scheduler->cancel_task(m_task);
		switch (m_state) {
		case SmdSatState::starting:         state_starting_exit(); break;
		case SmdSatState::powering_on:      state_powering_on_exit(); break;
		case SmdSatState::load_kmac:        state_load_kmac_exit(); break;
		case SmdSatState::idle_pending:     state_idle_pending_exit(); break;
		case SmdSatState::idle:             state_idle_exit(); break;
		case SmdSatState::transmit_pending: state_transmit_pending_exit(); break;
		case SmdSatState::transmitting:     state_transmitting_exit(); break;
		case SmdSatState::error:            state_error_exit(); break;
		case SmdSatState::stopped:          break;
		default: break;
		}
		m_state = SmdSatState::stopped;
		state_stopped_enter();
	}

	// Clean up transport in case state was already stopped
	m_cmd.deinit();
}

// ============================================================================
// State machine
// ============================================================================

void SmdSat::state_machine(bool use_scheduler) {
	m_next_delay = 0;

	switch (m_state) {
	case SmdSat::starting:
		SMD_STATE_CALL(starting);
		break;
	case SmdSat::powering_on:
		SMD_STATE_CALL(powering_on);
		break;
	case SmdSat::load_kmac:
		SMD_STATE_CALL(load_kmac);
		break;
	case SmdSat::idle_pending:
		SMD_STATE_CALL(idle_pending);
		break;
	case SmdSat::idle:
		SMD_STATE_CALL(idle);
		break;
	case SmdSat::transmit_pending:
		SMD_STATE_CALL(transmit_pending);
		break;
	case SmdSat::transmitting:
		SMD_STATE_CALL(transmitting);
		break;
	case SmdSat::error:
		SMD_STATE_CALL(error);
		break;
	case SmdSat::stopped:
		SMD_STATE_CALL(stopped);
		break;
	default:
		break;
	}

	if (use_scheduler && !SMD_STATE_EQUAL(stopped)) {
		system_scheduler->cancel_task(m_task);
		m_task = system_scheduler->post_task_prio([this]() {
			state_machine();
		}, "SmdReceiverStateMachine", Scheduler::DEFAULT_PRIORITY, m_next_delay);
	}
}

void SmdSat::state_starting_enter() {}
void SmdSat::state_starting_exit() {}

void SmdSat::state_starting()
{
	m_is_first_tx = true;
	is_kmac_profil_loaded = false;  // Force entry to state_load_kmac for boot config (TCXO, LPM)
	// m_needs_explicit_kmac_load is NOT reset here — it persists across power cycles.
	// Only set true when RCONF/credentials actually change (steps 1a/1b in load_kmac).
	// When false, STM32 auto-initializes MAC from flash at POR — no SPI command needed.
	m_credentials_written = false;
	m_rconf_recovery_attempted = false;
	// SPI init is deferred to state_idle_pending (after power-on + reset release).
	// Initializing SPI here would configure MISO as input without pulldown while
	// the STM32WL is booting — risk of MISO backfeed via nRF ESD diode.
	m_state_counter = 3;
	m_next_delay = 0;
	SMD_STATE_CHANGE(starting, powering_on);
}

void SmdSat::state_error_enter() {
	// Force KMAC reload on next boot — SMD may be in inconsistent state.
	// Do NOT attempt SPI commands here — the bus is likely desynchronized
	// (INVALID_CMD cascade). Any command would fail and waste time.
	is_kmac_profil_loaded = false;
	m_error_count++;

	if (m_error_count >= SMD_MAX_CONSECUTIVE_ERRORS) {
		// Too many consecutive errors — enter 30 min cooldown to stop SPI spam
		// and save battery.  SMD will be retried after cooldown expires.
		m_cooldown_until = PMU::get_timestamp_ms() + SMD_ERROR_COOLDOWN_MS;
		DEBUG_ERROR("SmdSat: %u consecutive errors — cooldown for %u min",
			m_error_count, SMD_ERROR_COOLDOWN_MS / 60000);
		m_error_count = 0;  // Reset for next attempt after cooldown
	}

	notify(KineisEventDeviceError({}));
	SMD_STATE_CHANGE(error, stopped);
}

