spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	PMU::kick_watchdog();
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);

	// Write pending credentials to SMD before reading them back.
	// PARMW saves credentials to the nRF config store but does NOT push
	// them to the SMD. Without this, SATVF reads stale/empty flash.
	if (configuration_store && configuration_store->is_credentials_dirty()) {
		DEBUG_INFO("SmdSat::%s: credentials dirty — writing to SMD before verify", __func__);
		if (write_credentials_from_config()) {
			configuration_store->clear_credentials_dirty();
			// KMAC reload so the MAC picks up the new RCONF
			try {
				m_cmd.load_kmac_profil(1);
				nrf_delay_ms(SMDSAT_DELAY_LOAD_KMAC_MS);
			} catch (...) {
				DEBUG_WARN("SmdSat::%s: KMAC reload failed after credential write", __func__);
			}
		} else {
			DEBUG_ERROR("SmdSat::%s: credential write failed before verify", __func__);
		}
	}

	try {
		if (dec_id) {
			uint32_t dec_id_val = 0;
			m_cmd.read_id(&dec_id_val);
			*dec_id = static_cast<unsigned int>(dec_id_val);
			nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
		}

		if (address) {
			uint8_t address_data[SMDSAT_CMD_READ_ADDR_LEN] = {0};
			smd_uint8_array_t address_value = {SMDSAT_CMD_READ_ADDR_LEN, address_data};
			m_cmd.read_address(&address_value);
			nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
			*address  = (static_cast<uint32_t>(address_value.p_data[0]) << 24) |
			            (static_cast<uint32_t>(address_value.p_data[1]) << 16) |
			            (static_cast<uint32_t>(address_value.p_data[2]) << 8)  |
			            (address_value.p_data[3]);
		}

		if (seckey) {
			uint8_t seckey_data[SMDSAT_CMD_READ_SECKEY_LEN] = {0};
			smd_uint8_array_t seckey_value = {SMDSAT_CMD_READ_SECKEY_LEN, seckey_data};
			m_cmd.read_seckey(&seckey_value);
			nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
			*seckey = Binascii::hexlify(std::string(reinterpret_cast<char *>(seckey_data), SMDSAT_CMD_READ_SECKEY_LEN));
		}

		if (radioconf) {
			uint8_t rconf_raw[SMDSAT_CMD_READ_RCONF_RAW_LEN] = {0};
			uint16_t rconf_raw_len = 0;
			m_cmd.read_rconf_raw(rconf_raw, &rconf_raw_len);
			nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
			*radioconf = Binascii::hexlify(std::string(reinterpret_cast<char *>(rconf_raw),
			                               rconf_raw_len > 0 ? rconf_raw_len : SMDSAT_CMD_READ_RCONF_RAW_LEN));
			DEBUG_INFO("SmdSat::%s: RCONF_RAW: %s", __func__, radioconf->c_str());
		}
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: error during credential read", __func__);
		if (was_stopped) {
			m_cmd.deinit();
			shutdown();
			GPIOPins::release_sensors_pwr();
			nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
		}
		throw;
	}

	if (was_stopped) {
		m_cmd.deinit();
		shutdown();
		GPIOPins::release_sensors_pwr();
		nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
	}
}

// ============================================================================
// Runtime modulation switching
// ============================================================================

bool SmdSat::switch_modulation(KineisModulation mode, const std::string& rconf_hex) {
	SmdArgosModulation target = kineis_to_smd_mod(mode);
	if (target == m_modulation) {
		DEBUG_TRACE("SmdSat::%s: already in target modulation %d", __func__, static_cast<int>(target));
		return true;
	}

	DEBUG_INFO("SmdSat::%s: switching %d -> %d", __func__, static_cast<int>(m_modulation), static_cast<int>(target));

	if (rconf_hex.size() != 32) {
		DEBUG_ERROR("SmdSat::%s: invalid RCONF hex length %u (expected 32)", __func__, static_cast<unsigned>(rconf_hex.size()));
		return false;
	}

	// If SMD is stopped, defer the switch — RCONF will be written on next power-on
	if (m_state == SmdSatState::stopped) {
		DEBUG_INFO("SmdSat::%s: SMD stopped, deferring switch to %d", __func__, static_cast<int>(target));
		m_modulation = target;
		m_pending_rconf = rconf_hex;
		// Force state_load_kmac on next boot so the deferred RCONF gets applied.
		// Without this, idle_pending skips to idle and the RCONF is never written.
		is_kmac_profil_loaded = false;
		return true;
	}

	// Timing: set_radio_conf is a 2-phase write (~30ms SPI) but the STM32 needs
	// time to process it. save_radio_conf triggers a flash persistence (~100ms).
	// load_kmac_profil needs the MAC to re-initialize with the new RCONF.
	// Old timing (60ms everywhere) caused TX REQ failures because the MAC was
	// not ready after KMAC reload. Increase progressively:
	// - After RCONF write: 80ms (STM32 processes + small margin)
	// - After RCONF save: 120ms (flash write ~100ms + margin)
	// - After KMAC load:  200ms (MAC re-init, less than clean-repo's 1000ms)

	// 1. Write RCONF
	std::string rconf_bin = Binascii::unhexlify(rconf_hex);
	smd_uint8_array_t rconf_struct = {static_cast<uint16_t>(rconf_bin.size()),
	                                  reinterpret_cast<uint8_t *>(rconf_bin.data())};
	try {
		m_cmd.set_radio_conf(&rconf_struct);
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: failed to write RCONF", __func__);
		return false;
	}

	nrf_delay_ms(80);  // STM32 RCONF processing

	// 2. Save RCONF to flash
	try {
		if (!m_cmd.save_radio_conf()) {
			DEBUG_ERROR("SmdSat::%s: failed to save RCONF", __func__);
			return false;
		}
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: save_radio_conf exception", __func__);
		return false;
	}

	nrf_delay_ms(120);  // Flash persistence (~100ms) + margin

	// 3. Reload KMAC profile 1
	try {
		m_cmd.load_kmac_profil(1);
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: failed to reload KMAC", __func__);
		return false;
	}

	nrf_delay_ms(200);  // MAC re-init after KMAC reload

	// Update cached modulation
	m_modulation = target;
	is_kmac_profil_loaded = true;

	DEBUG_INFO("SmdSat::%s: modulation switched to %d OK", __func__, static_cast<int>(target));
	return true;
}

KineisModulation SmdSat::get_current_modulation() const {
	return smd_to_kineis_mod(m_modulation);
}

// ============================================================================
// DFU (delegates to command layer)
// ============================================================================

